<html>
<head>
</head>
<body>
<h2>Vigen&egrave;re</h2>
Die im 16. Jahrhundert entstandene Vigen&egrave;re-Verschl&uuml;sselung (nach Blaise de Vigen&egrave;re) galt lange als sicherer Chiffrieralgorithmus (&quote;Le Chiffre indechiffrable&quote;, deutsch: &quote;Die unentzifferbare Verschl&uuml;sselung&quote;). Ein Schl&uuml;sselwort bestimmt, wie viele und welche Alphabete genutzt werden. Die Alphabete leiten sich aus der Caesar-Substitution ab.
Dem britischen Mathematiker Charles Babbage gelang um das Jahr 1854 erstmals die Entzifferung einer Vigen&egrave;re-Chiffre. Diese Entdeckung wurde jedoch damals nicht &ouml;ffentlich bekannt gemacht. Der preu&szlig;ische Offizier Friedrich Kasiski ver&ouml;ffentlichte im Jahr 1863 seine L&ouml;sung und ging damit in die Geschichte ein.

<h2>Kryptoanalyse</h2>
Schl&uuml;sselw&ouml;rter, die im Verh&auml;ltnis zum Text relativ kurz sind, bieten kaum Sicherheit. Die L&auml;nge des Schl&uuml;ssels l&auml;sst sich herausfinden, indem der Text mit sich selbst (um n Stellen verschoben) korreliert und das n mit dem gr&ouml;&szlig;ten Korrelationswert ermittelt wird. Ist somit die Schl&uuml;ssell&auml;nge (Periode) n bekannt, reduziert sich die Kryptoanalyse der Vigen&egrave;re-Verschl&uuml;sselung auf die der Caesar-Verschl&uuml;sselung: alle ersten, zweiten, ..., n-ten Buchstaben einer Periode geh&ouml;ren jeweils zur selben Caesar-Verschl&uuml;sselung und eine H&auml;ufigkeitsanalyse verr&auml;t die Buchstabenzuordnung.
Bei einem Text, der nur aus der Wiederholung eines Zeichens besteht, zeigt sich die Periode unmittelbar im Geheimtext. Ein normaler Text weist ausreichend Redundanzen auf, so dass ab einer gewissen L&auml;nge des Textes im Vergleich zum Schl&uuml;ssel auch hier die Periode abgeleitet werden kann (Kasiski-Test, Friedman-Test).
<br><br>
Text:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;eeeeeeeeeeeee<br>
Schl&uuml;ssel:&nbsp;&nbsp;&nbsp;&nbsp;AKEYAKEYAKEYA<br>
Geheimtext:&nbsp;eoiceoiceoice<br>
<br>
Auf diese Weise bekommt man recht schnell die Schl&uuml;ssell&auml;nge des verschl&uuml;sselten Textes heraus. Jetzt muss nur noch der Geheimtext spaltenweise zerlegt werden. Die Spalten, welche mit demselben Buchstaben verschl&uuml;sselt wurden, werden zusammengefasst. Die entsprechende Alphabetverschiebung der einzelnen Teiltexte l&ouml;st man nun mittels H&auml;ufigkeitsanalyse.
Weist der Text keine oder nur wenige Redundanzen auf, beispielsweise weil er kurz ist, l&auml;sst sich die Schl&uuml;ssell&auml;nge nicht mit dem Kasiski-Test herausfinden. Unter der Voraussetzung, dass es sich bei dem Schl&uuml;ssel um ein Wort aus einem W&ouml;rterbuch handelt und auch der Plaintext mit einem Wort beginnt, l&auml;sst sich jedoch durch geschicktes Aussortieren unwahrscheinlicher N-Gramm-Paare in vielen F&auml;llen der Schl&uuml;ssel finden. Dazu werden zuerst Plaintext/Schl&uuml;ssel-Kombinationen bewertet, ohne dass es eine Rolle spielt, was davon Plaintext bzw. Schl&uuml;ssel ist. Die Anzahl der M&ouml;glichkeiten wird so bereits im ersten Schritt von 26 auf 13 halbiert (N/E->R und E/N->R). Alle dann noch verbleibenden N-Gramm-Paare werden nun gem&auml;&szlig; ihrer Wahrscheinlichkeit, am Anfang eines Wortes zu stehen, gewichtet. Ist mindestens eines der N-Gramme &auml;u&szlig;erst unwahrscheinlich an einem Wortanfang, wird das ganze Paar verworfen. Beispiel: EIN/TKX und alle diesem Zweig folgenden 4-Gramme k&ouml;nnen verworfen werden, da TKX als Beginn einer Nachricht/Schl&uuml;ssel als extrem unwahrscheinlich erachtet wird. Meist zeigt sich bereits ab Tetragrammen, dass die Anzahl der &uuml;brig gebliebenen Paare so stark reduziert wurde, dass eine &Uuml;berpr&uuml;fung aller restlichen M&ouml;glichkeiten machbar ist. Es bleiben statt 456.976 (= 26^4 bei Tetragrammen) meist nur ca. einhundert sinnvolle M&ouml;glichkeiten &uuml;brig. Anhand eines W&ouml;rterbuches k&ouml;nnen nun alle W&ouml;rter, die mit diesen Tetragrammen beginnen, als Schl&uuml;ssel ausprobiert werden, bis sich ein schl&uuml;ssiger Plaintext ergibt. Eine ausf&uuml;hrliche Beschreibung wurde 2008 ver&ouml;ffentlicht und ist in CrypTool v1.4.30 implementiert.
Einzig ein Text aus statistisch gleich verteilten, unsinnigen Buchstabenfolgen w&auml;re einem Ciphertext-only-Angriff nicht ohne Weiteres zug&auml;nglich.

</body>
</html>


