Repository: matthiasplappert/Cryptographics
Catalog: po/*.po
Languages: de

source: The next step is to send the right color to Bob, as shown in the demonstration. You have three possible colors to send and one is the right color. If you need help click the 'Help' button.
de: Der nächste Schritt ist das Senden der richtigen Farbe an Bob, wie in der Demonstration gezeigt. Du hast drei mögliche Farben zum verschicken, aber nur eine ist die richtige. Wenn du Hilfe benötigst, klicke den dafür vorgesehenen Button.

source: Oh no. You chose the private color. This color is meant to be private. If you had sent this color, Eve would be able to get the secret too, afterwards. Please try again, by choosing another color and clicking the 'send color' button.
de: Oh nein. Du hast die geheime Farbe gewählt. Diese Farbe soll auch geheim bleiben. Wenn du diese Farbe gesendet hättest, wäre Eve in der Lage das Geheimnis zu erlangen. Versuche es nochmal mit einer anderen Farbe und klicke den 'Farbe senden' Button.

source: Oh no. You chose the public color. While Eve won't be able to get the secret shared color, you still didn't follow the protocol instructions. Try again by choosing another color.
de: Oh nein. Du hast die öffentliche Farbe gewählt. Eve wird zwar nicht in der Lage sein, das Geheimnis zu erfahren, aber genausowenig wird Bob es erlangen können. Versuche eine andere Farbe.

source: Good. You sent your mixture to Bob. This is the right choice.
de: Gut. Du hast die richtige Farbe an Bob geschickt. Das war die richtige Wahl.

source: Now it is Bobs turn. Click the continue button, so that Bob will choose his private color and send you his mixture.
de: Nun ist Bob an der Reihe. Klicke den 'Weiter' Button, sodass Bob seine geheime Farbe wählen, und die Mixtur schicken kann.

source: This is the last step in the protocol. Choose the right colors to produce the final secret, just like how it was explained at the demonstration.
de: Dies ist der letzte Schritt des Protokolls. Wähle die richtige Farbe um das endgültige Geheimnis zu erstellen, genau so, wie in der Demonstration erklärt.

source: Congratulations, you chose the right colors to mix, you and Bob established a shared secret that Eve does not know.
de: Glückwunsch, du hast die richtige Farbe gewählt. Du und Bob habt nun ein gemeinsames Geheimnis erstellt, welches Eve nicht kennt.

source: You have to choose a public color, to choose a different color you have to click the '->' or '<-' Button. You can't do much wrong. When you are ready click the 'send color' button.
de: Du musst eine öffentliche Farbe wählen. Um eine Farbe zu wählen, drücke die Pfeilbuttons. Du kannst dabei nichts falsch machen. Wenn du fertig bist, klicke den 'Farbe senden' Button.

source: You have to choose a private color, which is not the same as the public color. To choose a color, you have to click the '->' or the '<-' Button. You can't do much wrong. When you are ready, click the 'mix colors' button.
de: Du musst eine geheime Farbe wählen, welche eine andere sein soll als die öffentliche Farbe. Verwende die Pfeilbuttons um eine auszuwählen, und klicke den 'Farben mischen' Button.

source: You have to send the right color, the right color is the one you have not already sent, and the one you don't want to keep private. If you still have no clue, try the three different colors.
de: Du musst die richtige Farbe wählen. Das ist diejenige, die du noch nicht gesendet hast und die die du nicht geheim halten willst. Wenn du es immer noch nicht weißt, probier herum.

source: Just click the continue button and Bob will mix his color and will send it to you.
de: Klicke einfach auf den 'Weiter' Button und Bob wird seine Farben mischen und sie dir zuschicken.

source: You have to choose the two colors that will be mixed to the final shared secret. Tip: Why can't Eve compute the secret. Right, you have a color that Eve does not have, so you have to use that one. It is the color with the label SA. The other color is the one you got from Bob which is the mixture of Bob, MB
de: Du musst die Farben wählen die gemischt werden müssen um das endgültige Geheimnis zu erzeugen. Tipp: Warum kann Eve das Geheimnis nicht berechnen? Richtig, du hast eine Farbe die Eve nicht hat, also musst du diese verwenden, also SA. Die andere Farbe ist die, die du von Bob bekommen hast, also MB

source: Mix with public color
de: Mische mit öffentlicher Farbe

source: Mix colors to final secret
de: Endgültiges Geheimnis mischen

source: The private color can't be the same as the public color
de: Die geheime Farbe kann nicht die gleiche sein wie die öffentliche

source: Send color
de: Farbe senden

source: You chose the wrong colors, try again
de: Du hast die falsche Farbe gewählt, versuch's nochmal

source: Skip the Experiment
de: Selbstversuch überspringen

source: Start Experiment
de: Selbstversuch starten

source: Now it's your turn! Now you are Alice and try to establish a shared secret with Bob, without Eve getting the secret. Your task will be to mix the right Colors and to send the right Colors, just like in the Demonstration
de: Nun bist du an der Reihe! Nun bist du Alice und versuchst ein gemeinsames Geheimnis mit Bob aufzubauen, ohne das Eve es erfährt. Deine Aufgabe ist das richtige Mischen und Senden der Farben, genau wie in der Demonstration

source: Find out how you can encrypt something in such a way that it is impossible for someone else to crack it!
de: Finde heraus, wie man etwas so verschlüsseln kann, dass es unmöglich für jemanden wird, es zu knacken!

source: http://en.wikipedia.org/wiki/One-time_pad
de: https://de.wikipedia.org/wiki/One-Time-Pad

source: Learn about the cryptographic hash function SHA-2. A hash function allows you to transform your data in one direction only, making it impossible to reverse the process!
de: Erfahre mehr über die kryptographische Hashfunktion SHA-2. Eine Hashfunktion verschlüsselt Daten und macht es dabei unmöglich, die Daten wieder zu entschlüsseln!

source: http://en.wikipedia.org/wiki/SHA_2
de: https://de.wikipedia.org/wiki/SHA-2

source: Get to know how Vigenère fixed the weaknesses of Caesar to make a 'secure' cipher for many hundred years!
de: Seh dir an, wie Vigenère die Schwäche der Caesar-Chiffre beseitigte, und eine für viele hunderte Jahre 'sichere' Chiffre erschuf.

source: http://en.wikipedia.org/wiki/Vigen%C3%A8re_cipher
de: http://de.wikipedia.org/wiki/Polyalphabetische_Substitution#Vigen.C3.A8re-Verschl.C3.BCsselung

source: After Caesar's cipher was broken, Vigenère started to create his own cipher which would fix the weaknesses of Caesar. He also used the same logic by addition and subtraction of characters but this time the key would not be a simple number but a whole string. To understand how Vigenères cipher works, we need to know how 'modulo' works...
de: Nachdem die Caesar-Chiffre gebrochen wurde, fing Vigenère an, seine eigene Chiffre zu erstellen, welche die Schwächen von Caesar beheben soll. Er verwendete die gleiche Logik, jedoch mit einem Schlüssel der mehr als nur ein Zeichen enthält. Um zu wissen wie die Vigenère-Chiffre funktioniert, müssen wir erst sehen wie 'Modulo' funktioniert...

source: We use modulo in our daily life without maybe noticing it: If you look at your clock, you have a cyclic sequence of numbers. Like you see in the picture at the bottom, 4 hours after 9 means it's 1. So our clock uses a modulo of 12, because we have only 12 steps in it. If we overflow, we start from the beginnig. The same system will now be used with the alphabet (which has 26 characters) to create Vigenère's cipher...
de: Wir verwenden Modulo täglich in unserem Leben ohne es vielleicht zu merken: Wenn du auf die Uhr schaust, hast du eine zyklische Sequenz von Zahlen. Wie du in dem Bild unten sehen kannst, ist 4 Stunden nach 9: 1. Also verwendet unsere Uhr den Modulo von 12, da wir nur 12 Ziffern haben. Wenn es überläuft, fängt es von vorne an. Das selbe System wird nun für das Alphabet verwendet, welches 26 Zeichen hat...

source: Go to Encryption
de: Zur Verschlüsselung

source: Now we want to encrypt 'ANNA'. First of all we add the position of evey character, as you can see in the bottom, in the alphabet under each character.
de: Nun wollen wir 'ANNA' verschlüsseln. Zuerst fügen wir unter jedem Buchstaben im Alphabet eine Position hinzu, wie du unten sehen kannst.

source: This is the key for the encryption. Now we go to the next step and encrypt the first character.
de: Das ist der Schlüssel für die Verschlüsselung. Nun gehen wir zum nächsten Schritt und verschlüsseln das erste Zeichen.

source: The position of 'A' in the alphabet is 1. The position of 'O' is 14. Now we calculate 1 + 14 and get 15.
de: Die Position von 'A' im Alphabet ist 1. Die Position von 'O' ist 14. Also berechnen wir 1 + 14 und erhalten 15.

source: The number 16 represents 'P' in the alphabet. So the first encrypted character is 'P'. Lets go to the next one.
de: Die Zahl 16 repräsentiert 'P' im Alphabet. Also ist das erste verschlüsselte Zeichen 'P'. Weiter gehts mit dem nächsten.

source: Now get to the next character. It's an 'N', which represents the number 14. The second character of the key is 'K', which is the 11. 14+11 = 25 -> 'Y'!
de: Nun zum nächsten Buchstaben. Es ist ein 'N' welches durch 14 repräsentiert wird. Das zweite Zeichen des Schlüssels ist 'K', also 11. 14 + 11 = 25 -> 'Y'!

source: Now we continue...
de: Nun fahren wir fort...

source: The position of 'A' in the alphabet is 1. The position of 'O' is 15. Now we calculate 1 + 15 and get 16.
de: Die Position von 'A' im Alphabet ist 1. Die Position von 'O' ist 15. Also berechnen wir 1 + 15 und erhalten 16.

source: E = 5 and Y = 25. 25 + 5 = 30, but our alphabet doesnt have 30 characters. So we now use the modulo: 30 modulo 26 = 4.
de: E = 5 und Y = 25. 25 + 5 = 30, aber unser Alphabet hat nur 26 Buchstaben. Also verwenden wir Modulo: 30 modulo 26 = 4.

source: Follow the explanations!
de: Folge den Anweisungen!

source: Plaintext-Char
de: Klartextzeichen

source: Key-Char
de: Schlüssel-Zeichen

source: Result
de: Ergebnis

source: Now we want to encrypt 'ANNE'. First of all we add the position of every character, as you can see in the bottom, in the alphabet under each character.
de: Nun wollen wir 'ANNA' verschlüsseln. Zuerst fügen wir unter jedem Buchstaben im Alphabet eine Position hinzu, wie du unten sehen kannst.

source: Vigenere Key
de: Vigenère Schlüssel

source: Return to Introduction
de: Zurück zur Einführung

source: Now we want to decrypt 'ENQM'. Instead of adding up, we use substraction to decrypt it! So let's go...
de: Nun wollen wir 'ENQM' entschlüsseln. Anstatt nun zu addieren, subtrahieren wir um zu entschlüsseln. Los geht's...

source: 'E' = 5 and 'K' = 11. 3 - 11 = -6. What now? Well it's easy, just reverse the modulo...
de: 'E' = 5 und 'K' = 11. 3 - 11 = -6. Was jetzt? Ganz einfach, wir invertieren Modulo...

source: Negative numbers mean you start from the 'Z' and go 7 steps backwards. So we get 'T' = 20!
de: Negative Zahlen bedeuten, du fängst bei 'Z' an und gehst 7 Schritte zurück. So erhalten wir 'T' = 20!

source: 'N' = 14 and 'I' = 9. 14 - 9 = 5 -> 'E'
de: 'N' = 14 und 'I' = 9. 14 - 9 = 5 -> 'E'

source: 'Q' = 17 and 'S' = 19. 17 - 19 = -2 -> Go 2 Steps backwards from 'Z' -> 'X'
de: 'Q' = 17 und 'S' = 19. 17 - 19 = -2 -> Gehe 2 Schritte zurück von 'Z' aus -> 'X'

source: 'M' = 13 and 'S' = 19. 13 - 19 = -6 -> Go 6 Steps backwards from 'Z' -> 'T'
de: 'M' = 13 und 'S' = 19. 13 - 19 = -6 -> Gehe 6 Schritte zurück von 'Z' aus -> 'T'

source: Go To Experiment
de: Zum Selbstversuch

source: Return to Encryption
de: Zurück zur Verschlüsselung

source: Very nice, now the second character!
de: Sehr gut, nun der zweite Buchstabe!

source: Second strike! Three left...
de: Zweiter strike! Drei übrig...

source: Not much left, 2 to go...
de: Nur noch zwei übrig...

source: Almost done, last character...
de: Fast geschafft, letztes Zeichen...

source: Nicely done!
de: Sehr gut!

source: 'T' = 20 and 'A' = 1, so just substract 1 from 20 and you have the answer!
de: 'T' = 20 und 'A' = 1, also subtrahierst du 1 von 20 und du hast das Ergebnis!

source: 'W' = 23 and 'B' = 2, so just substract 2 from 23 and you have the answer!
de: 'W' = 23 und 'B' = 2, also subtrahierst du 2 von 23 und du hast das Ergebnis!

source: 'S' = 19 and 'C' = 3, so just substract 3 from 19 and you have the answer!
de: 'S' = 19 und 'C' = 3, also subtrahierst du 3 von 19 und du hast das Ergebnis!

source: 'I' = 9 and 'D' = 4, so just substract 4 from 9 and you have the answer!
de: 'I' = 9 und 'D' = 4, also subtrahierst du 4 von 9 und du hast das Ergebnis!

source: 'W' = 23 and 'E' = 5, so just substract 5 from 23 and you have the answer!
de: 'W' = 23 und 'E' = 5, also subtrahierst du 5 von 23 und du hast das Ergebnis!

source: Now it's your turn! Decrypt this string...
de: Nun bist du dran! Entschlüsse den Text...

source: Wrong Answer! Try again!
de: Falsche Antwort! Versuchs nochmal!

source: Go to Explanation
de: Zur Erklärung

source: Return to Decryption
de: Zurück zur Entschlüsselung

source: Vigenère fixed a few weaknesses of Caesar, but still has flaws. If the key is shorter than the text to encrypt, Vigenère simply concatinates it with itself until the key is long enough. This again makes it weak against key-length-guessing. As soon as we guess the key-length, we can use a histogram (explained in Caesar) to make a static analysis. So let's crack this chiffre by guessing the key-length (we will use the Kasiski test for it)
de: Vigenère behob ein paar Schwächen von Caesar, hat aber immernoch ein paar. Wenn der Schlüssel kürzer als der Text ist, konkateniert Vigenère ihn einfach an sich selbst bis er lang genug ist. Das wiederrum macht ihn schwach für Schlüssellängeraten. Sobald wir die Schlüssellänge wissen, können wir Histogramme verwenden (wie in Caesar). Los geht's mit dem Brechen der Chiffre durch Raten der Schlüssellänge (wir verwenden den Kasiski-Test dafür)

source: Length of key: 2
de: Länge des Schlüssels: 2

source: Since we know that the key-length is 2, every second character will be encrypted with the first character of the key. To guess which is the first character of the key we need the histogram of every second character in the chiffre
de: Da wir wissen, dass die Schlüssellänge 2 ist, wird jedes zweite Zeichen mit dem ersten Buchstaben des Schlüssels verschlüsselt. Um herauszufinden, was der erste Buchstabe des Schlüssels ist, erstellen wir ein Histogramm mit jedem zweiten Buchstaben der Chiffre

source: Just read the instructions!
de: Les' einfach die Anleitungen!

source: Go to Cracking
de: Zum Knacken

source: Return to Experiment
de: Zurück zum Selbstversuch

source: Vigenère fixed a few weaknesses of Caesar, but still has flaws. If the key is shorter then the text to encrypt, Vigenère simply concatinates it with itself until the key is long enough. This again makes it weak against key-length-guessing. As soon as we guess the key-length, we can use a histogram (explained in Caesar) to make a static analysis. So lets crack this chiffre by guessing the key-length (we will use the Kasiski test for it)
de: Vigenère behob ein paar Schwächen von Caesar, hat aber immernoch ein paar. Wenn der Schlüssel kürzer als der Text ist, konkateniert Vigenère ihn einfach an sich selbst bis er lang genug ist. Das wiederrum macht ihn schwach für Schlüssellängeraten. Sobald wir die Schlüssellänge wissen, können wir Histogramme verwenden (wie in Caesar). Los geht's mit dem Brechen der Chiffre durch Raten der Schlüssellänge (wir verwenden den Kasiski-Test dafür)

source: This is the average distribution of the characters in English texts:
de: Das ist die durchschnittliche Verteilung eines deutschen Texts:

source: Find Key-Length
de: Finde Schlüssellänge

source: Length of key: ?
de: Länge des Schlüssels: ?

source: When we look closer at the histogram we see some differences in the distribution of the characters; 'S' is has the most common occurance. In an average normal English text 'E' is the most common one. So maybe our 'S' could've been an 'E' before the encryption. We calculate 19 (position of 'S') - 5 (position of 'E') and we get 14, which means the first character of the key is 'N'.
de: Wenn wir uns die Histogramme genauer anschauen sehen wir einige Unterschiede in der Verteilung. 'S' kommt am häufigsten vor. In einem durchschnittlichen deutschen Text ist 'E' der häufigste. Also könnte 'S' vor der Verschlüsselung ein 'E' gewesen sein. Wir rechnen also 'S' - 'E' = 19 - 5 = 15. Das heißt, das erste Zeichen unsres Schlüssels ist 'N'.

source: Very nice! We found the key 'NJ', now we can decrypt the message:
de: Sehr gut! Wir haben den Schlüssel 'NJ' gefunden. Nun können wir die Nachricht entschlüsseln:

source: Now it's your turn! You have to find the second character of the key. I was kind enough to give you a diagram of every second character encrypted with the second part of the key.You know what to do:
de: Nun bist du dran! Du musst das zweite Zeichen des Schlüssels finden. Ich war nett genug dir die Diagramme jedes zweiten verschlüsselten Zeichens zu geben, welches mit dem zweiten Zeichens des Schlüssels verschlüsselt wurden. Du weißt was zu tun ist:

source: Check the peaks in the histogram and compare them to the other histogram, do you see any similarities?
de: Prüfe die Spitzen des Histogramms und vergleiche sie mit dem anderen Histogramm. Siehst du Ähnlichkeiten?

source: Go to Information
de: Weitere Informationen

source: Return to Explanation
de: Zurück zur Erklärung

source: Look at the peaks of both histograms and calculate the second part of the key! Your answer:
de: Schau dir die Spitzen beider Histogramme an und berechne den zweiten Teil des Schlüssels. Deine Antwort:

source: Easy
de: Einfach

source: Medium
de: Mittel

source: Hard
de: Schwer

source: Not Interactive
de: Nicht interaktiv

source: Here you can learn more about {0}. You can also scan the QR code at the bottom of the page to take additional information home. Once you're done, just click the exit button.
de: Hier kannst du mehr über {0} erfahren. Du kannst auch den QR-Code unten an der Seite einscannen, um die Informationen mit nach Hause nehmen. Wenn du fertig bist, drücke einfach den 'Beenden'-Button.

source: keyboard-y
de: Z

source: keyboard-z
de: Y

source: Back
de: Zurück
