Repository: matthiasplappert/Cryptographics
Catalog: po/*.po
Languages: de

source: You haven't done anything in a while. To keep this exhibit functional, the system will reset itself soon. If you want to continue using the system, just dismiss this dialog.
de: Du hast längere Zeit keine Aktivität gezeigt. Um dieses Exponat betriebsbereit zu halten, wird es sich in Kürze zurücksetzen. Verwirf dieses Dialogfenster, um fortzufahren.

source: Continue
de: Weiter

source: {0} B.C.
de: {0} v.Chr.

source: Exit
de: Beenden

source: Help
de: Hilfe

source: Welcome
de: Willkommen

source: This is Cryptographics, a small tool with the aim to show how basic and advanced cryptographic procedures work in principle. Below you can see a timeline with some procedures. Tap on the dots representing their date of invention to view a small description and start the visualization.
de: Das ist Cryptographics, ein kleines Programm um zu zeigen, wie einfache und fortgeschrittene kryptographische Verfahren im Prinzip funktionieren. Unten siehst du eine Zeitleiste mit einigen Verfahren. Berühre die Punkte die das Erfindungsjahr repräsentieren, um eine kleine Übersicht zu sehen und die Visualisierung zu starten.

source: Learn about one of the most important modern ciphers, the Advanced Encryption Standard!
de: Erfahre mehr über die wichtigste moderne Chiffre, dem Advanced Encryption Standard!

source: http://en.wikipedia.org/wiki/Advanced_Encryption_Standard
de: https://de.wikipedia.org/wiki/Advanced_Encryption_Standard

source: Get to know how Ceasar fooled his enemys that intercepted his orders and see one of the oldest attempts to make confidential material unreadable for undesireable readers.
de: Erfahre, wie Caesar seine Feinde an der Nase herumführte, die seine Befehle abgefangen haben, und sehe einen der ersten Versuche, Geheimnisse unlesbar für unerwünschte Empfänger zu machen.

source: http://en.wikipedia.org/wiki/Caesar_cipher
de: http://de.wikipedia.org/wiki/Caesar-Verschl%C3%BCsselung

source: Key
de: Schlüssel

source: Great work oh mighty Caesar. May your enemies shutter over your intelligence. Now we can move on to the real experiment and test your skills.
de: Gute Arbeit, oh mächtiger Caesar. Mögen deine Feinde vor deiner Intelligenz erzittern. Nun können wir fortfahren um deine Fähigkeiten zu prüfen.

source: Very nice! Let's encrypt the rest of your name. Touch proceed.
de: Sehr gut! Nun verschlüssle noch den Rest. Drücke 'Weiter'.

source: Only {0} left.
de: Es ist {0} übrig.

source: Because of your inferior intelligence you look at the first letter of your name: C. Then you look at the 3rd letter after C and take F. Great! Now you encrypted the first letter of your name. Touch proceed.
de: Aufgrund deiner überragenden Intelligenz schaust du dir den ersten Buchstabens des Namens an: C. Dann schaust du dir den dritten Buchstaben nach dem C an und wählst das F. Super! Nun hast du schon den ersten Buchstaben deines Namens verschlüsselt. Drücke 'Weiter'.

source: Now try to encrypt the next letter yourself. If you need help, you can always use the help button.
de: Versuche nun den nächsten Buchstaben selbst zu verschlüsseln. Wenn du Hilfe brauchst, kannst du jederzeit den Hilfe-Button drücken.

source: Oh mighty Caesar. No one will ever be able to destroy you! Because of that fact lets end this childish games and finish the rest of the fields fast. Then we can send the courier again but this time your enemies will have no idea who wrote it and you will conquer the world.
de: Oh mächtiger Caesar. Keiner wird jemals in der Lage sein dich zu zerstören! Verschlüssle nun schnell noch die restlichen Buchstaben, dann können wir den Kurier erneut losschicken, doch dieses Mal wird der Feind keine Ahnung haben, wer die Nachricht gesendet hat, und du wirst die Welt erobern.

source: Remember: Position of C in the alphabet is 3 and the key is also 3. C + key = C + 3 = 3 + 3 = 6. And 6 is the position of letter F in the alphabet. Et voila you encrypted C with the key of 3.
de: Denke dran: Die Position von C im Alphabet ist 3 und der Schlüssel ist auch 3. C + Schlüssel = C + 3 = 3 + 3 = 6, was die Position von F im Alphabet ist. Et voila, du hast C mit dem Schlüssel 3 verschlüsselt.

source: Back to Introduction
de: Zurück zur Einführung

source: Skip the demonstration
de: Demonstration überspringen

source: Proceed
de: Weiter

source: Imagine now you are the mighty Caesar! Of course your first idea is to substitute each letter from your name with another one from the alphabet. But which one? Press proceed to move on.
de: Stell dir nun vor du wärst der mächtige Caesar! Natürlich ist deine erste Idee, Buchstaben des Alphabets auf andere abzubilden. Doch nur auf welche? Drücke 'Weiter'.

source: Unfortunately his courier took the way through the forest, where Kryptolix chased some wild boars.
de: Zu seinem Unglück ging der Bote durch den Wald, wo Kryptolix seine Wildschweine jagte.

source: When Kryptolix noticed the unsuspecting and whistling roman courier, he punched him back to Rome as the crow flies. But the courier had lost his invaluable scroll!
de: Als Kryptolix den nichts ahnenden Boten entdeckte beförderte er ihn via Luftlinie direkt nach Rom zurück! Doch der Kurier verlor eine unschätzbar wertvolle Schriftrolle!

source: When reading the scroll the courier lost, Kryptolix identified it as Caesar's plan to conquer Gallia. Because of this, Kryptolix and his friends were able to defeat Caesar once more!
de: Beim Lesen der Schriftrolle, die der Bote dabei hatte, erkannte Kryptolix Caesars Pläne Gallien zu erobern. Dadurch waren Kryptolix und seine Freunde in der Lage, Caesar erneut zu schlagen!

source: Caesar was raging! While he was torturing some Gauls, suddenly an hellacious and foolproof idea crossed his mind. In his next message he would encrypt his name! Hue Hue Hue. Help him!
de: Caesar tobte! Während er ein paar arme Schweine folterte, hatte er plötzlich einen teuflischen und idiotensicheren Plan. In seiner nächsten Nachricht wird er seinen Namen verschlüsseln! Hue Hue Hue. Hilf ihm!

source: To Caesar's idea
de: Zu Caesars Idee

source: If you want to hear the awesome legend about Caesar and Kryptolix press the button below the text. Otherwise you can skip this with the button in the top right corner!
de: Wenn du die großartige Legende über Caesar und Kryptolix hören möchtest, drücke den Button unterhalb des Texts. Andernfalls überspringe diesen Schritt mit dem 'Überspringen'-Button.

source: Skip the introduction
de: Einführung überspringen

source: Tell me more
de: Erzähl' mir mehr

source: One fine day, ca 70 B.C., Caesar was puzzling on an extremely intelligent plan to finally conquer Gallia and was about to send it to his generals.
de: Eines Tages, etwa 70 v.Chr., tüftelte Caesar an einem extrem intelligenten Plan um endlich Gallien zu erobern und war dabei, ihn an seine Generäle zu schicken.

source: Remember: If you want to decrypt for example D with the key of 3. You need to substract 3 from the position of D in the alphabet. D - key = 4 - 3 = 1 = A. And if you get a negative Value add 26. For example: A - 8 = 1 - 8 = -7. Now add 26 + (-7) = 19 = S.
de: Denke dran: Wenn du beispielsweise D mit dem Schlüssel 3 entschlüsseln willst, musst du 3 von der Position von D im Alphabet abziehen. D - Schlüssel = 4 - 3 = 1 = A. Wenn der Wert negativ wird, addiere einfach 26. Beispiel: A - 8 = 1 - 8 = -7 => -7 + 26 = 19 = S.

source: Remember: If you want to encrypt for example A with the key of 3. You need to add 3 to the position of A in the alphabet. A + key = 1 + 3 = 4 = D. And if you get a value that is bigger then 26 then substract 26 from it. For example: S + 8 = 19 + 8 = 27. Now substract 26: 27 - 26 = 1 = A.
de: Denke dran: Wenn du z.B. A mit dem Schlüssel 3 verschlüsseln willst, musst du 3 an die Position von A addieren. A + Schlüssel = 1 + 3 = 4 = D. Wenn das Ergebnis größer als 26 wird, musst du 26 subtrahieren. Beispiel: S + 8 = 19 + 8 = 27 => 27 - 26 = 1 = A.

source: All done right!
de: Alles richtig!

source: The next step is to decrypt a given message! Let's move on to decrypting.
de: Der nächste Schritt ist das entschlüsseln einer gegebenen Nachricht.

source: In the next stage of the visualization you will learn how to decrypt without a key.
de: Im nächsten Schritt wirst du sehen, wie man ohne einen Schlüssel entschlüsseln kann.

source: You have {0} left!
de: Es ist {0} übrig.

source: You have already learned much. But you've probably already asked yourself: How do I decrypt?
de: Du hast nun schon viel gelernt, doch du hast dich sicher schon gefragt, wie man eine Nachricht jetzt entschlüsselt?

source: It's simple: subtract the key from a given letter. And if you get a negative value add 26 to it.
de: Es ist einfach: Du musst den Schlüssel einfach von jedem Buchstaben subtrahieren. Wenn das Ergebnis negativ wird, addiere 26 dazu.

source: Go to Histograms
de: Zu den Histogrammen

source: Your input is invalid. Please try another one!
de: Die Eingabe ist ungültig. Versuch einen anderen!

source: This input is ok. Now only the key is left.
de: Die Eingabe ist in Ordnung. Nun noch der Schlüssel.

source: This key is not valid. Please put a number between 1 and 26. For demonstration purposes the keys between -1 and -26 are not necessary therefore not possible, but could be used in general as keys too.
de: Der Schlüssel ist ungültig. Bitte wähle eine Zahl zwischen 1 und 26. Aus Demonstrationsgründen seien die Schlüssel von -1 bis -26 nicht weiter von Belangen und demnach auch nicht möglich, aber im Allgemeinen können sie durchaus auch als Schlüssel verwendet werden.

source: The key field is empty!
de: Der Schlüssel ist leer!

source: This key is ok. Now put your name into the bigger box to the left.
de: Der Schlüssel ist okay. Nun schreibe noch deinen Namen in das Feld links.

source: Back to Demonstration
de: Zurück zur Demonstration

source: Go to Decryption
de: Zur Entschlüsselung

source: In the demonstration you encrypted with the key 3. On further thought it seems logical that this key can vary from 1 to 26.
de: In der Demonstration hast du mit dem Schlüssel 3 verschlüsselt. Wenn man den Gedanken weiterspinnt, ist es logisch, dass der Schlüssel zwischen 1 bis 26 liegen kann.

source: Now you have 2 options:
de: Du hast zwei Möglichkeiten:

source: 1. You can either put your own key and plaintext into the textfield,
de: 1. Du gibst deinen Namen und einen Schlüssel in das Textfeld ein,

source: 2. or you just click "Generate" and this awesome program will generate a key and plaintext for you.
de: 2. oder du drückst einfach den 'Generiere Namen'-Button und das Programm wird es für dich generieren.

source: Let's test what you have learned. If help needed touch the help button.
de: Sehen wir was du gelernt hast. Wenn du Hilfe benötigst, drücke den 'Hilfe'-Button

source: Put your name in here!
de: Wähle hier deinen Namen!

source: Or
de: Oder

source: Generate letters
de: Generiere Buchstaben

source: Oh no. What a pity! It went wrong!
de: Oh nein. Schade! Das stimmt nicht!

source: No my friend. This one doesn't work!
de: Nein mein Freund... das klappt nicht!

source: Sorry, that was wrong. Don't give up now!
de: Leider war das falsch. Gib nicht auf!

source: Great work, oh mighty Caesar!
de: Gute Arbeit, oh mächtiger Caesar.

source: Very nice. I like!
de: Sehr gut. Gefällt mir!

source: No one could've done it better!
de: Niemand hätte es besser machen können!

source: BANANA
de: BANANE

source: SECRET
de: GEHEIM

source: The diagram you see here shows the frequency of each letter in the text you are reading at the moment. It is called a Histogram. If you would count all E's in this explanation you would get the number you see in the diagram on the column above the letter E. Now the program will encrypt this explanation with an unknown key in a most awesome way and we will see the histogram of the cipher. Click Proceed and see the magic!
de: Die Diagramme die du hier siehst zeigen die Häufigkeit jedes Buchstabens in dem Text den du gerade liest. Es nennt sich ein Histogramm. Würdest du alle E's in dieser Erklärung zählen, würdest du auf die Zahl kommen die in der Spalte über dem Buchstaben E steht. Das Programm wird nun diese Erklärung mit einem unbekannten Schlüssel verschlüsseln und du wirst das Histogramm des Chiffrats sehen. Klicke auf 'Weiter' und sieh es dir an.

source: Remember 'E' is in most cases the most frequent letter in a text. The column in the histogram above E would be the tallest one. So the tallest column in the histogram of a cipher would be the value E was shifted to. For example, 'H' is the tallest one. Simply 'H'- 'E' = 8 - 5 = 3. Et voila 3 is the key.
de: Denke dran: 'E' ist in den meisten Fällen der häufigste Buchstabe in einem Text. Die Spalte für 'E' im Histogramm müsste also die größte sein. Also ist die größte Spalte im Histogramm des Chifrats jene, nach der 'E' geschoben wurde. Beispiel: 'H' ist die größte Spalte. 'H' - 'E' = 8 - 5 = 3. Et voila, 3 ist der Schlüssel.

source: In order to find an unknown key you must try all of them. If you are lucky, you dont have to try many. In the worst case you have to try all of them.
de: Um einen unbekannten Schlüssel zu finden, musst du alle probieren. Wenn du Glück hast findest du ihn schnell. Im schlechtesten Fall musst du alle probieren.

source: You found the right key! See how easy it is with histograms? If you want to try one more press proceed. Otherwise you can go directly to further information. There you can learn more about caesar's cipher.
de: Du hast den Schlüssel gefunden! Siehst du wie einfach das mit Histogrammen ist? Wenn du nochmal eines ausprobieren möchtest, klicke auf 'Weiter'. Andernfalls kannst du zu den weiterführenden Informationen gehen. Dort erfährst du noch mehr über die Caesar-Chiffre.

source: The key was wrong.
de: Der Schlüssel ist falsch.

source: This key is invalid. Please type a number between 1 and 26. If you dont understand why, it is recommended to go to early stages.
de: Der Schlüssel ist ungültig. Bitte wähle eine Zahl zwischen 1 und 26. Wenn du nicht verstehst warum, dann schau dir die vorherigen Schritte nochmals an.

source: The key field was empty!
de: Der Schlüssel ist leer!

source: You found the secret key and are now able to read the secret message. The Key is
de: Du hast den geheimen Schlüssel gefunden und bist nun in der Lage die geheime Nachricht zu lesen. Der Schlüssel war

source: Now only the histogram technique left.
de: Nun ist nur noch die Histogramm-Methode ürbig.

source: The Key was
de: Der Schlüssel war

source: Congratulations! Yeay! Now lets try to break it with histograms.
de: Glückwunsch! Yeay! Lass es uns nun mit Histogrammen versuchen.

source: Or: If you want to try a more elaborate way breaking Caesar-cipher you can try histogram technique by pressing the button below.
de: Oder: Wenn du eine vornehmere Methode anwenden willst, um die Caesar-Chiffre zu brechen, kannst du die Histogramm-Methode probieren. Drücke den Button unten.

source: Try histogram technique
de: Versuche Histogramm-Methode

source: When you look at the histogram of the cipher you can see that 'H' is now the most frequent one. It is obvious that the letter 'E' was shifted to 'H'. When we substract 'H' - 'E' we get the key. Put the key 3 in the box below and let the programm decrypt the cipher with it.
de: Wenn du dir das Histogramm des Chiffrats ansiehst, erkennst du, dass 'H' der häufigste Buchstabe ist. Offenbar wurde also 'E' nach 'H' verschoben. Wenn du 'E' von 'H' subtrahierst, erhälst du den Schlüssel 3. Gib den Schlüssel in das Feld unten ein und das Programm wird das Chiffrat entschlüsseln.

source: Ok lets try another one!
de: Okay, nochmal eins!

source: Cryptologists call it 'breaking a cipher' when someone tries to decrypt text without knowing the key.
de: Kryptologen nennen es 'die Chiffre brechen' wenn jemand einen Text entschlüsselt, ohne den Schlüssel zu kennen.

source: There are always 2 options when it comes to this.
de: Es gibt immer 2 Möglichkeiten dies zu tun.

source: 1. You use literally brute force, meaning you simply try each possible key.
de: 1. Du verwendest Brute-Force, das bedeutet du versuchst einfach jeden Schlüssel.

source: 2. You use elaborate cryptology techniques.
de: 2. Du verwendest kryptographische Verfahren.

source: Lets try brute force
de: Versuche Brute-Force

source: Brute force means trying to decrypt with each possible key, till you find the right one.The Key is in the middle. And pressing buttons increments or decrements it. Let's search.
de: Brute-Force bedeutet, dass man alle möglichen Schlüssel durchprobiert, bis man den richtigen gefunden hat. Der Schlüssel ist in der Mitte. Die Buttons erhöhen oder erniedrigen den Schlüssel. Und los.

source: &darr;Histogram of the cipher.&darr;
de: &darr;Histogramm des Chiffrats.&darr;

source: &darr;Histogram of the original text.&darr;
de: &darr;Histogramm des Originaltexts.&darr;

source: Type your key in this&darr; box and click 'Enter'.
de: Wähle den Schlüssel hier&darr; und drücke 'Eingabe'.

source: Back to Experiment
de: Zurück zum Selbstversuch

source: Skip the Histograms
de: Histogramme überspringen

source: The infamous Diffie-Hellman Key-Exchange explained with a color-mixing analogy. Establish a shared secret, without an eavesdropper getting the secret, too!
de: Der berüchtigte Diffie-Hellman Schlüsseltausch, erklärt durch eine Farbenanalogie. Baue ein gemeinsames Geheimnis auf, ohne dass ein Angreifer das Geheimnis auch erfährt!

source: http://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange
de: http://de.wikipedia.org/wiki/Diffie-Hellman-Schl%C3%BCsselaustausch

source: No help
de: Keine Hilfe

source: We use a simple analogy as the one-way function. Mixing colors is an easy process, determining which colors were originally used is a difficult process, thus this acts like an one-way function
de: Wir verwenden eine einfache Analogie als Einwegfunktion. Das Farbenmischen ist einfach, aber herauszufinden aus welchen Farben eine Mixtur besteht, sehr schwer. Das fungiert als Einwegfunktion.

source: Go to Demo
de: Zur Demo

source: easy
de: einfach

source: hard
de: schwer

source: To achieve this, we use something called one-way function. This type of function is easy to compute in one direction, but difficult to reverse.
de: Um das zu erreichen, verwenden wir eine Einwegfunktion. Diese Funktion ist in eine Richtung leicht zu berechnen, aber sehr schwer umzukehren.

source: Now to our Diffie-Hellman Key-Exchange Analogy. Here is how the protocol in principle works. Alice chooses a public color and sends it to Bob. As Eve listens to the channel she gets a copy.
de: Nun zu unserer Diffie-Hellman Schlüsselaustausch Analogie. Hier siehst du, wie das Protokoll im Prinzip funktioniert. Alice wählt eine öffentliche Farbe und sendet sie an Bob. Da Eve den Kanal abhorcht, erhält sie eine Kopie.

source: Next, Alice chooses a private color, that she keeps for herself, she does not send it. Then she mixes her private color with the previously sent public color and sends the mixture to Bob. Note that because we use the mixing of colors as a one-way function, Eve cannot compute which private color Alice used to get the mixture. Keep this in mind, as this is critical to understand why this protocol works. As previously Bob and Eve have the sent color, that means the mixture of Alice.
de: Als nächstes wählt Alice eine geheime Farbe, die sie für sich behält und nicht sendet. Dann mischt sie ihre geheime Farbe mit der zuvor gesendeten öffentlichen Farbe und sendet die Mixtur an Bob. Beachte, dass wir das Farbenmischen als Einwegfunktion betrachten, also kann Eve die geheime Farbe nicht berechnen. Behalte das im Hinterkopf, denn das ist wichtig um zu verstehen wie das Protokoll funktioniert. Wie zuvor haben Bob und Eve die gesendete, gemischte Farbe von Alice.

source: Now Bob does the exact same thing like Alice did in the previous step. He chooses a private color. Mixes it with the public color, and sends the mixture to Alice. Eve gets a copy, but can't compute the private color of Bob, because of the one-way function property
de: Nun macht Bob das gleiche wie Alice zuvor. Er wählt eine geheime Farbe, mischt sie mit seiner öffentlichen Farbe, und sendet die Mixtur an Alice. Eve erhält auch dieses Mal eine Kopie, doch kann wieder nicht berechnen, was die geheime Farbe von Bob ist.

source: Here we will produce the secret that Alice and Bob know, but Eve doesn't. Alice will mix her private color to the mixture of Bob and Bob will mix his private color to the mixture of Alice. The trick lies in the combination of the private Colors, that are kept private, through the use of the one-way function and that it doesn't matter in which order we mix the colors. So mixing first the public color with Alices private color and then Bobs private color yields the same color as mixing first the public color with Bobs private color and then Alices private color.
de: Hier erstellen wir ein Geheimnis, welches nur Alice und Bob kennen, aber Eve nicht. Alice mischt ihre geheime Farbe mit der Mixtur von Bob, und Bob mischt seine geheime Farbe mit der Mixtur von Alice. Der Trick liegt in der Kombination der geheimen Farben, die geheim gehalten werden durch das Verwenden der Einwegfunktion, dabei macht die Reihenfolge des Mischens kein Unterschied. Das heißt, das Mischen der öffentlichen Farbe mit Alice's geheimer Farbe und dann Bob's geheimer Farbe ist das gleiche wie die öffentliche Farbe, gemischt mit Bob's Farbe, gemischt mit Alice' Farbe.

source: Skip the Demonstration
de: Demonstration überspringen

source: Skip Introduction
de: Einführung überspringen

source: Our aim is to exchange a secret on a public channel, without Eve getting the secret too. Therefore we can't simply send the secret, as shown in the figure above as Eve would get the secret too. Thus we need to exchange the secret in a different way
de: Unser Ziel ist es, ein Geheimnis über einen öffentlichen Kanal zu verschicken, ohne das auch Eve das Geheimnis erfährt. Deshalb können wir das Geheimnis nicht einfach verschicken, wie in der Animation oben gezeigt wird. Daher müssen wir das Geheimnis auf einen anderen Weg tauschen

source: Skip the Introduction
de: Einführung überspringen

source: P - The base color
de: P - Die Basisfarbe

source: SA - Alice's secret color
de: SA - Alice's geheime Farbe

source: SB - Bob's secret color
de: SB - Bob's geheime Farbe

source: MA - Mixture of SA and P
de: MA - Mischung von SA und P

source: MB - Mixture of SB and P
de: MB - Mischung von SB und P

source: To achive this, we use something called one-way function. This function is easy to compute in one direction, but difficult to reverse.
de: Um das zu erreichen, verwenden wir eine Einwegfunktion. Diese Funktion ist in eine Richtung leicht zu berechnen, aber sehr schwer umzukehren.

source: Congratulations
de: Glückwunsch

source: Next
de: Weiter

source: Now it is your turn! Choose a public color, which will be the basis for the coming operations. When you're are done, click the 'send color' button to send it to Bob.
de: Nun bist du dran! Wähle eine öffentliche Farbe, welche die Grundlage des Selbstversuchs sein wird. Wenn du eine Farbe gewählt hast, Klicke 'Farbe senden' um sie an Bob zu schicken.

source: Now you can choose a private color which you can mix with the public color you previously send to Bob. When you're done, click the 'Mix with public color' button.
de: Nun wähle eine geheime Farbe welche du mit der öffentlichen Farbe mischen kannst die du zuvor an Bob geschickt hast. Wenn du eine Farbe die dir gefällt gewählt hast, klicke 'Mische mit öffentlicher Farbe'.
